xmlsamples/DAS_Query/PROD-TW-GetDeliveryOptionTemplate-AIS-TWD00.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xrsi="http://www.westernunion.com/schema/xrsi" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Header/>
   <soapenv:Body>
      <xrsi:h2h-das-request>
         <channel>
            <type>H2H</type>
            <name>KTB</name>
            <version>9500</version>
         </channel>
         <foreign_remote_system>
            <identifier>WGWDTWD000P</identifier>
            <reference_no>WU15101020038813</reference_no>
            <counter_id>TWD00WDPFP1A</counter_id>
         </foreign_remote_system>
         <client_id>H2H</client_id>
         <name>GetDeliveryOptionTemplate</name>
         <account_num>AET290014</account_num>
         <filters>
            <queryfilter1>en</queryfilter1>
            <queryfilter2>VN VND</queryfilter2>
            <queryfilter3>4040</queryfilter3>
         </filters>
      </xrsi:h2h-das-request>
   </soapenv:Body>
</soapenv:Envelope>